# Pandas

In [1]:
import pandas as pd

In [3]:
cars = pd.read_csv("cars.csv")

In [4]:
cars.head()

,symboling,normalized-losses,make,fuel-type,body-style,drive-wheels,engine-location,width,height,engine-type,engine-size,horsepower,city-mpg,highway-mpg,price
0,3,?,alfa-romero,gas,convertible,rwd,front,64.1,48.8,dohc,130,111,21,27,13495
1,3,?,alfa-romero,gas,convertible,rwd,front,64.1,48.8,dohc,130,111,21,27,16500
2,1,?,alfa-romero,gas,hatchback,rwd,front,65.5,52.4,ohcv,152,154,19,26,16500
3,2,164,audi,gas,sedan,fwd,front,66.2,54.3,ohc,109,102,24,30,13950
4,2,164,audi,gas,sedan,4wd,front,66.4,54.3,ohc,136,115,18,22,17450

In [5]:
cars.tail()

,symboling,normalized-losses,make,fuel-type,body-style,drive-wheels,engine-location,width,height,engine-type,engine-size,horsepower,city-mpg,highway-mpg,price
200,-1,95,volvo,gas,sedan,rwd,front,68.9,55.5,ohc,141,114,23,28,16845
201,-1,95,volvo,gas,sedan,rwd,front,68.8,55.5,ohc,141,160,19,25,19045
202,-1,95,volvo,gas,sedan,rwd,front,68.9,55.5,ohcv,173,134,18,23,21485
203,-1,95,volvo,diesel,sedan,rwd,front,68.9,55.5,ohc,145,106,26,27,22470
204,-1,95,volvo,gas,sedan,rwd,front,68.9,55.5,ohc,141,114,19,25,22625

In [6]:
cars.shape

(205, 15)

In [8]:
cars.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 205 entries, 0 to 204
Data columns (total 15 columns):
symboling            205 non-null int64
normalized-losses    205 non-null object
make                 205 non-null object
fuel-type            205 non-null object
body-style           205 non-null object
drive-wheels         205 non-null object
engine-location      205 non-null object
width                205 non-null float64
height               205 non-null float64
engine-type          205 non-null object
engine-size          205 non-null int64
horsepower           205 non-null object
city-mpg             205 non-null int64
highway-mpg          205 non-null int64
price                205 non-null int64
dtypes: float64(2), int64(5), object(8)
memory usage: 24.1+ KB

In [9]:
cars.describe()

,symboling,width,height,engine-size,city-mpg,highway-mpg,price
count,205.000000,205.000000,205.000000,205.000000,205.000000,205.000000,205.000000
mean,0.834146,65.907805,53.724878,126.907317,25.219512,30.751220,13227.478049
std,1.245307,2.145204,2.443522,41.642693,6.542142,6.886443,7902.651615
min,-2.000000,60.300000,47.800000,61.000000,13.000000,16.000000,5118.000000
25%,0.000000,64.100000,52.000000,97.000000,19.000000,25.000000,7788.000000
50%,1.000000,65.500000,54.100000,120.000000,24.000000,30.000000,10345.000000
75%,2.000000,66.900000,55.500000,141.000000,30.000000,34.000000,16500.000000
max,3.000000,72.300000,59.800000,326.000000,49.000000,54.000000,45400.000000

In [10]:
# Average price of the cars

cars["price"].mean()

13227.478048780487

In [11]:
# max price of car

cars["price"].max()

45400

In [12]:
# Which car is the costliest ?
cars["price"] == 45400

0      False
1      False
2      False
3      False
4      False
       ...
200    False
201    False
202    False
203    False
204    False
Name: price, Length: 205, dtype: bool

In [13]:
cars[cars["price"] == 45400]

,symboling,normalized-losses,make,fuel-type,body-style,drive-wheels,engine-location,width,height,engine-type,engine-size,horsepower,city-mpg,highway-mpg,price
74,1,?,mercedes-benz,gas,hardtop,rwd,front,72.0,55.4,ohcv,304,184,14,16,45400

In [14]:
cars[cars["price"] == cars["price"].max()]

,symboling,normalized-losses,make,fuel-type,body-style,drive-wheels,engine-location,width,height,engine-type,engine-size,horsepower,city-mpg,highway-mpg,price
74,1,?,mercedes-benz,gas,hardtop,rwd,front,72.0,55.4,ohcv,304,184,14,16,45400

In [15]:
cars[cars["price"] == cars["price"].max()]["make"]

74    mercedes-benz
Name: make, dtype: object

In [16]:
# another way

In [17]:
cars["price"].max()

45400

In [18]:
cars["price"].idxmax()

74

In [20]:
cars.iloc[74]["make"]

'mercedes-benz'

In [21]:
# Which car has lowest city-mileage
# which engine-type has highest highway-mileage
# which body-style car is the cheapest

In [24]:
cars["city-mpg"].min()

13

In [25]:
cars["city-mpg"].idxmin()

49

In [27]:
cars.iloc[49]["make"]

'jaguar'

In [28]:
cars["highway-mpg"].idxmax()

30

In [30]:
cars.iloc[30]["engine-type"]

'ohc'

In [31]:
cars["price"].idxmin()

138

In [34]:
cars.iloc[138]["body-style"]

'hatchback'

In [35]:
# categorical columns

In [37]:
cars["make"].unique()

array(['alfa-romero', 'audi', 'bmw', 'chevrolet', 'dodge', 'honda',
       'isuzu', 'jaguar', 'mazda', 'mercedes-benz', 'mercury',
       'mitsubishi', 'nissan', 'peugot', 'plymouth', 'porsche', 'renault',
       'saab', 'subaru', 'toyota', 'volkswagen', 'volvo'], dtype=object)

In [39]:
cars["make"].value_counts()

toyota           32
nissan           18
mazda            17
honda            13
mitsubishi       13
subaru           12
volkswagen       12
peugot           11
volvo            11
dodge             9
mercedes-benz     8
bmw               8
plymouth          7
audi              7
saab              6
porsche           5
isuzu             4
jaguar            3
chevrolet         3
alfa-romero       3
renault           2
mercury           1
Name: make, dtype: int64

In [ ]:
# what are the different fuel-types, which one is used the most?
# which body-style cars are very less
# how many engine-types and which is less used

In [40]:
cars["fuel-type"].value_counts()

gas       185
diesel     20
Name: fuel-type, dtype: int64

In [42]:
cars["fuel-type"].value_counts().head(1)

gas    185
Name: fuel-type, dtype: int64

In [43]:
cars["fuel-type"].value_counts().tail(1)

diesel    20
Name: fuel-type, dtype: int64

In [44]:
cars["body-style"].value_counts()

sedan          96
hatchback      70
wagon          25
hardtop         8
convertible     6
Name: body-style, dtype: int64

In [45]:
cars["body-style"].value_counts().tail(1)

convertible    6
Name: body-style, dtype: int64

In [48]:
cars["engine-type"].value_counts().tail(1)

dohcv    1
Name: engine-type, dtype: int64

## groupby

In [49]:
mydict = {"name":["Jack","Jill","Jack","Jill"],"subject":["ML","ML","PY","PY"],"marks":[80,90,96,84]}

In [50]:
mydict

{'name': ['Jack', 'Jill', 'Jack', 'Jill'],
 'subject': ['ML', 'ML', 'PY', 'PY'],
 'marks': [80, 90, 96, 84]}

In [51]:
df = pd.DataFrame(mydict)

In [52]:
df

   name subject  marks
0  Jack      ML     80
1  Jill      ML     90
2  Jack      PY     96
3  Jill      PY     84

In [55]:
df.groupby("name").groups

{'Jack': Int64Index([0, 2], dtype='int64'),
 'Jill': Int64Index([1, 3], dtype='int64')}

In [56]:
df.groupby("subject").groups

{'ML': Int64Index([0, 1], dtype='int64'),
 'PY': Int64Index([2, 3], dtype='int64')}

In [57]:
# To group by categories and perform aggregate functions -> sum, max, min, mean, std

In [58]:
df.groupby("name")["marks"].sum()

name
Jack    176
Jill    174
Name: marks, dtype: int64

In [59]:
df.groupby("name")["marks"].mean()

name
Jack    88
Jill    87
Name: marks, dtype: int64

In [60]:
# What is the average city-mileage for each manufacturer ?

# What is the average price for each body-style of car ?
# What is the average highway-mpg for each engine-style ?
# What is the average price for each make of the car ?

In [61]:
cars.groupby("make")["city-mpg"].mean()

make
alfa-romero      20.333333
audi             18.857143
bmw              19.375000
chevrolet        41.000000
dodge            28.000000
honda            30.384615
isuzu            31.000000
jaguar           14.333333
mazda            25.705882
mercedes-benz    18.500000
mercury          19.000000
mitsubishi       24.923077
nissan           27.000000
peugot           22.454545
plymouth         28.142857
porsche          17.400000
renault          23.000000
saab             20.333333
subaru           26.333333
toyota           27.500000
volkswagen       28.583333
volvo            21.181818
Name: city-mpg, dtype: float64

In [62]:
cars.groupby("body-style")["price"].mean()

body-style
convertible    21890.500000
hardtop        22208.500000
hatchback      10015.800000
sedan          14502.260417
wagon          12371.960000
Name: price, dtype: float64

In [63]:
cars.groupby("engine-type")["highway-mpg"].mean()

engine-type
dohc     24.833333
dohcv    28.000000
l        28.833333
ohc      32.567568
ohcf     29.600000
ohcv     21.230769
rotor    23.000000
Name: highway-mpg, dtype: float64

In [67]:
#What is the average price for each make of the car ?

#cars.groupby("make")["price"].mean().sort_values()

cars.groupby("make")["price"].mean().sort_values(ascending=False)

make
jaguar           34600.000000
mercedes-benz    33647.000000
porsche          27520.400000
bmw              26118.750000
volvo            18063.181818
audi             17022.142857
mercury          16503.000000
alfa-romero      15498.333333
peugot           15489.090909
saab             15223.333333
isuzu            12708.250000
mazda            10652.882353
nissan           10415.666667
volkswagen       10077.500000
toyota            9885.812500
renault           9595.000000
mitsubishi        9239.769231
subaru            8541.250000
honda             8184.692308
plymouth          7963.428571
dodge             7875.444444
chevrolet         6007.000000
Name: price, dtype: float64

In [68]:
# Which make has the highest average price ?

In [71]:
cars.groupby("make")["price"].mean().idxmax()

'jaguar'

In [72]:
# Which body-style has minimum average city-mpg

In [76]:
cars.groupby("body-style")["city-mpg"].mean().idxmin()

'convertible'

In [78]:
# Which engine-type has lowest average highway-mpg?

cars.groupby("engine-type")["highway-mpg"].mean().idxmin()

'ohcv'

In [79]:
# multiple level category groups

In [80]:
cars.groupby(["body-style","fuel-type"])["price"].mean()

body-style   fuel-type
convertible  gas          21890.500000
hardtop      diesel       28176.000000
             gas          21356.000000
hatchback    diesel        7788.000000
             gas          10048.086957
sedan        diesel       14774.400000
             gas          14451.864198
wagon        diesel       19727.666667
             gas          11368.909091
Name: price, dtype: float64

In [81]:
df

   name subject  marks
0  Jack      ML     80
1  Jill      ML     90
2  Jack      PY     96
3  Jill      PY     84

In [82]:
newdict = {"name":["john","jack","jill"],"maths":[40,50,60],"science":[45,55,65]}

In [83]:
newdict

{'name': ['john', 'jack', 'jill'],
 'maths': [40, 50, 60],
 'science': [45, 55, 65]}

In [84]:
df = pd.DataFrame(newdict)

In [85]:
df

   name  maths  science
0  john     40       45
1  jack     50       55
2  jill     60       65

In [86]:
# how to add new rows and columns to a dataframe

In [88]:
df["total"] = df["maths"] + df["science"]

In [89]:
df

   name  maths  science  total
0  john     40       45     85
1  jack     50       55    105
2  jill     60       65    125

In [101]:

grade = pd.Series(["B","B","A"],name="grade")

In [102]:
pd.concat([df,grade],axis=1)

   name  maths  science  total grade
0  john     40       45     85     B
1  jack     50       55    105     B
2  jill     60       65    125     A